БухЭксп/InformationRegisters/CW_ПараметрыПланированияДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПланированияДДС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПересчитыватьСуммуПриСогласовании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыАвтоматическоеПланирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьВнутрихолдинговыеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСтатьяДДСВнутрихолдинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыСценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СценарииПланированияДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыИнициаторПоЗаявке</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеквизитыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЗаполненияСодержания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыПланированияДДС/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Запись = Получить(0);
	Если Запись.РасходыАвтоматическоеПланирование Тогда
		ПроверяемыеРеквизиты.Добавить("РасходыСтатьяДДС");
		ПроверяемыеРеквизиты.Добавить("РасходыСценарий");
		Если Запись.ВключатьВнутрихолдинговыеРасходы Тогда
			ПроверяемыеРеквизиты.Добавить("РасходыСтатьяДДСВнутрихолдинг");
		КонецЕсли; 		
	КонецЕсли; 
КонецПроцедуры

#КонецЕсли
